In [1]:
import pandas as pd
import numpy as np

# Lesson 2. Создание DateFrame и Series

In [3]:
pd.__version__

'1.5.3'

## Создание Series

In [4]:
pd.Series()

/var/folders/th/dn5zc4dd3rz56c206fznc1th0000gn/T/ipykernel_33056/2031691219.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  pd.Series()

Series([], dtype: float64)

In [14]:
select_from_list = pd.Series([5,6,9.8,1,7],
                            index=['row_1','row_2','row_3','row_4','row_5'],
                            dtype='string',
                            name = 'pd_Series') 
select_from_list

row_1      5
row_2      6
row_3    9.8
row_4      1
row_5      7
Name: pd_Series, dtype: string

In [15]:
dict_array = {'row_1':2,
              'row_2':3,
              'row_3':4,
              'row_4':5,
              'row_5':6}

In [ ]:
select_from_dict = pd.Series(dict_array,
                             index=['row_3','row_4','row_100'],
                             dtype = int, # нельзя, тк есть NaN и будет float
                             name = 'pd_Series')
select_from_dict

row_3      4.0
row_4      5.0
row_100    NaN
dtype: float64

In [22]:
np_array = np.array([5,6,6,7,8])
select_from_nparray = pd.Series(np_array,
                                copy = False)
select_from_nparray

0    5
1    6
2    6
3    7
4    8
dtype: int64

In [23]:
select_from_nparray.iloc[3] = 111
select_from_nparray

0      5
1      6
2      6
3    111
4      8
dtype: int64

In [24]:
np_array

array([  5,   6,   6, 111,   8])

In [25]:
np_array = np.array([5,6,6,7,8])
select_from_nparray = pd.Series(np_array,
                                copy = True)
select_from_nparray

0    5
1    6
2    6
3    7
4    8
dtype: int64

In [26]:
select_from_nparray.iloc[3] = 111
select_from_nparray

0      5
1      6
2      6
3    111
4      8
dtype: int64

In [27]:
np_array

array([5, 6, 6, 7, 8])

In [29]:
select_from_list

row_1      5
row_2      6
row_3    9.8
row_4      1
row_5      7
Name: pd_Series, dtype: string

In [28]:
series_from_series = pd.Series(select_from_list,
                               index = ['row_2','row_5','row_4'])
series_from_series

row_2    6
row_5    7
row_4    1
Name: pd_Series, dtype: string

## Создание DataFrame

In [30]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [31]:
dict_array = {'col_1':[5,5,6,3,7],
              'col_2':[27,56,7,4,7],
              'col_3':[27,6,0,-4,7],
              'col_4':[27,61,75,2,37],
              'col_5':[3,1,7,5,7],}

In [35]:
df = pd.DataFrame(dict_array,
                  index=['row_1','row_2','row_3','row_4','row_5'],
                  columns=['col_4','col_1','5'],
                  dtype=float)
df

       col_4  col_1   5
row_1   27.0    5.0 NaN
row_2   61.0    5.0 NaN
row_3   75.0    6.0 NaN
row_4    2.0    3.0 NaN
row_5   37.0    7.0 NaN

In [36]:
np_array = np.array([[5,5,6,3,7],
                     [27,56,7,4,7],
                     [27,6,0,-4,7],
                     [27,61,75,2,37],
                     [3,1,7,5,7]])
np_array

array([[ 5,  5,  6,  3,  7],
       [27, 56,  7,  4,  7],
       [27,  6,  0, -4,  7],
       [27, 61, 75,  2, 37],
       [ 3,  1,  7,  5,  7]])

In [37]:
df1 = pd.DataFrame(np_array,copy=True)
df1

    0   1   2  3   4
0   5   5   6  3   7
1  27  56   7  4   7
2  27   6   0 -4   7
3  27  61  75  2  37
4   3   1   7  5   7

In [39]:
df1.loc[:,3:4] = 111
df1

    0   1   2    3    4
0   5   5   6  111  111
1  27  56   7  111  111
2  27   6   0  111  111
3  27  61  75  111  111
4   3   1   7  111  111

In [40]:
np_array

array([[ 5,  5,  6,  3,  7],
       [27, 56,  7,  4,  7],
       [27,  6,  0, -4,  7],
       [27, 61, 75,  2, 37],
       [ 3,  1,  7,  5,  7]])

In [42]:
df1 = pd.DataFrame(np_array,copy=False)
df1.loc[:,3:4] = 111
df1

    0   1   2    3    4
0   5   5   6  111  111
1  27  56   7  111  111
2  27   6   0  111  111
3  27  61  75  111  111
4   3   1   7  111  111

In [43]:
np_array

array([[  5,   5,   6, 111, 111],
       [ 27,  56,   7, 111, 111],
       [ 27,   6,   0, 111, 111],
       [ 27,  61,  75, 111, 111],
       [  3,   1,   7, 111, 111]])

## Выравнивание индексов

In [45]:
dict_array = {'row_1':2,
              'row_2':3,
              'row_3':4,
              'row_4':5,
              'row_5':6}

In [46]:
pd.Series(dict_array)

row_1    2
row_2    3
row_3    4
row_4    5
row_5    6
dtype: int64

In [47]:
pd.Series([5,6,6,np.nan,7],index=['row_3','row_4','row_5','row_6','row_9'])

row_3    5.0
row_4    6.0
row_5    6.0
row_6    NaN
row_9    7.0
dtype: float64

In [50]:
df = pd.DataFrame({'col_1': pd.Series(dict_array),
                   'col_2': pd.Series([5,6,6,np.nan,7],index=['row_3','row_4','row_5','row_6','row_9'])},
                   index = ['row_1','row_7'])
df

       col_1  col_2
row_1    2.0    NaN
row_7    NaN    NaN

# Lesson 3. Чтение и запись данных
csv - command speated value

In [55]:
df = pd.read_csv('/Users/mikhail/Downloads/iris.csv',
                 sep = ',')
df

     5.1  3.5  1.4  0.2     Iris-setosa
0    4.9  3.0  1.4  0.2     Iris-setosa
1    4.7  3.2  1.3  0.2     Iris-setosa
2    4.6  3.1  1.5  0.2     Iris-setosa
3    5.0  3.6  1.4  0.2     Iris-setosa
4    5.4  3.9  1.7  0.4     Iris-setosa
..   ...  ...  ...  ...             ...
144  6.7  3.0  5.2  2.3  Iris-virginica
145  6.3  2.5  5.0  1.9  Iris-virginica
146  6.5  3.0  5.2  2.0  Iris-virginica
147  6.2  3.4  5.4  2.3  Iris-virginica
148  5.9  3.0  5.1  1.8  Iris-virginica

[149 rows x 5 columns]

In [59]:
df_col = pd.read_csv('/Users/mikhail/Downloads/iris.csv',
                 sep = ',',
                 index_col=['Iris-setosa'])
df_col

                5.1  3.5  1.4  0.2
Iris-setosa
Iris-setosa     4.9  3.0  1.4  0.2
Iris-setosa     4.7  3.2  1.3  0.2
Iris-setosa     4.6  3.1  1.5  0.2
Iris-setosa     5.0  3.6  1.4  0.2
Iris-setosa     5.4  3.9  1.7  0.4
...             ...  ...  ...  ...
Iris-virginica  6.7  3.0  5.2  2.3
Iris-virginica  6.3  2.5  5.0  1.9
Iris-virginica  6.5  3.0  5.2  2.0
Iris-virginica  6.2  3.4  5.4  2.3
Iris-virginica  5.9  3.0  5.1  1.8

[149 rows x 4 columns]

In [61]:
df_usecol = pd.read_csv('/Users/mikhail/Downloads/iris.csv',
                 sep = ',',
                 usecols=['5.1','1.4','Iris-setosa'])
df_usecol

     5.1  1.4     Iris-setosa
0    4.9  1.4     Iris-setosa
1    4.7  1.3     Iris-setosa
2    4.6  1.5     Iris-setosa
3    5.0  1.4     Iris-setosa
4    5.4  1.7     Iris-setosa
..   ...  ...             ...
144  6.7  5.2  Iris-virginica
145  6.3  5.0  Iris-virginica
146  6.5  5.2  Iris-virginica
147  6.2  5.4  Iris-virginica
148  5.9  5.1  Iris-virginica

[149 rows x 3 columns]

In [ ]:
df_squeeze = pd.read_csv('/Users/mikhail/Downloads/iris.csv',
                        squeeze = True # по-возможности меняет DataFrame на Series
                    )
df_squeeze

/var/folders/th/dn5zc4dd3rz56c206fznc1th0000gn/T/ipykernel_33056/3588743761.py:1: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  df_squeeze = pd.read_csv('/Users/mikhail/Downloads/iris.csv',

pandas.core.frame.DataFrame

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   5.1          149 non-null    float64
 1   3.5          149 non-null    float64
 2   1.4          149 non-null    float64
 3   0.2          149 non-null    float64
 4   Iris-setosa  149 non-null    object
dtypes: float64(4), object(1)
memory usage: 5.9+ KB

In [69]:
df_dtype = pd.read_csv('/Users/mikhail/Downloads/iris.csv',
                        dtype = {'Iris-setosa':'category'}
                    )
df_dtype.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   5.1          149 non-null    float64
 1   3.5          149 non-null    float64
 2   1.4          149 non-null    float64
 3   0.2          149 non-null    float64
 4   Iris-setosa  149 non-null    category
dtypes: category(1), float64(4)
memory usage: 5.0 KB

In [70]:
df_nrows = pd.read_csv('/Users/mikhail/Downloads/iris.csv',
                        nrows = 7
                    )
df_nrows

   5.1  3.5  1.4  0.2  Iris-setosa
0  4.9  3.0  1.4  0.2  Iris-setosa
1  4.7  3.2  1.3  0.2  Iris-setosa
2  4.6  3.1  1.5  0.2  Iris-setosa
3  5.0  3.6  1.4  0.2  Iris-setosa
4  5.4  3.9  1.7  0.4  Iris-setosa
5  4.6  3.4  1.4  0.3  Iris-setosa
6  5.0  3.4  1.5  0.2  Iris-setosa

In [73]:
df_encoding = pd.read_csv('/Users/mikhail/Downloads/iris.csv',
                        encoding='utf8'
                    )
df_encoding

     5.1  3.5  1.4  0.2     Iris-setosa
0    4.9  3.0  1.4  0.2     Iris-setosa
1    4.7  3.2  1.3  0.2     Iris-setosa
2    4.6  3.1  1.5  0.2     Iris-setosa
3    5.0  3.6  1.4  0.2     Iris-setosa
4    5.4  3.9  1.7  0.4     Iris-setosa
..   ...  ...  ...  ...             ...
144  6.7  3.0  5.2  2.3  Iris-virginica
145  6.3  2.5  5.0  1.9  Iris-virginica
146  6.5  3.0  5.2  2.0  Iris-virginica
147  6.2  3.4  5.4  2.3  Iris-virginica
148  5.9  3.0  5.1  1.8  Iris-virginica

[149 rows x 5 columns]

## Запись файлов csv

In [74]:
df = pd.read_csv('/Users/mikhail/Downloads/iris.csv')
df

     5.1  3.5  1.4  0.2     Iris-setosa
0    4.9  3.0  1.4  0.2     Iris-setosa
1    4.7  3.2  1.3  0.2     Iris-setosa
2    4.6  3.1  1.5  0.2     Iris-setosa
3    5.0  3.6  1.4  0.2     Iris-setosa
4    5.4  3.9  1.7  0.4     Iris-setosa
..   ...  ...  ...  ...             ...
144  6.7  3.0  5.2  2.3  Iris-virginica
145  6.3  2.5  5.0  1.9  Iris-virginica
146  6.5  3.0  5.2  2.0  Iris-virginica
147  6.2  3.4  5.4  2.3  Iris-virginica
148  5.9  3.0  5.1  1.8  Iris-virginica

[149 rows x 5 columns]

In [75]:
df.to_csv('iris_copy',sep = ';')

In [77]:
df_sep = pd.read_csv('iris_copy',sep = ';')
df_sep

     Unnamed: 0  5.1  3.5  1.4  0.2     Iris-setosa
0             0  4.9  3.0  1.4  0.2     Iris-setosa
1             1  4.7  3.2  1.3  0.2     Iris-setosa
2             2  4.6  3.1  1.5  0.2     Iris-setosa
3             3  5.0  3.6  1.4  0.2     Iris-setosa
4             4  5.4  3.9  1.7  0.4     Iris-setosa
..          ...  ...  ...  ...  ...             ...
144         144  6.7  3.0  5.2  2.3  Iris-virginica
145         145  6.3  2.5  5.0  1.9  Iris-virginica
146         146  6.5  3.0  5.2  2.0  Iris-virginica
147         147  6.2  3.4  5.4  2.3  Iris-virginica
148         148  5.9  3.0  5.1  1.8  Iris-virginica

[149 rows x 6 columns]

In [78]:
df.to_csv('iris_copy',sep = ';',columns=['5.1','3.5'])

In [79]:
df_col = pd.read_csv('iris_copy',sep = ';')
df_col

     Unnamed: 0  5.1  3.5
0             0  4.9  3.0
1             1  4.7  3.2
2             2  4.6  3.1
3             3  5.0  3.6
4             4  5.4  3.9
..          ...  ...  ...
144         144  6.7  3.0
145         145  6.3  2.5
146         146  6.5  3.0
147         147  6.2  3.4
148         148  5.9  3.0

[149 rows x 3 columns]

In [82]:
df.to_csv('iris_copy',sep = ';'
          ,columns=['5.1','Iris-setosa'],
          header=False)
df_header = pd.read_csv('iris_copy',sep = ';')
df_header

       0  4.9     Iris-setosa
0      1  4.7     Iris-setosa
1      2  4.6     Iris-setosa
2      3  5.0     Iris-setosa
3      4  5.4     Iris-setosa
4      5  4.6     Iris-setosa
..   ...  ...             ...
143  144  6.7  Iris-virginica
144  145  6.3  Iris-virginica
145  146  6.5  Iris-virginica
146  147  6.2  Iris-virginica
147  148  5.9  Iris-virginica

[148 rows x 3 columns]

In [83]:
df.to_csv('iris_copy',sep = ';'
          ,columns=['5.1','Iris-setosa'],
          header=['val_1','Iris_type'])
df_header = pd.read_csv('iris_copy',sep = ';')
df_header

     Unnamed: 0  val_1       Iris_type
0             0    4.9     Iris-setosa
1             1    4.7     Iris-setosa
2             2    4.6     Iris-setosa
3             3    5.0     Iris-setosa
4             4    5.4     Iris-setosa
..          ...    ...             ...
144         144    6.7  Iris-virginica
145         145    6.3  Iris-virginica
146         146    6.5  Iris-virginica
147         147    6.2  Iris-virginica
148         148    5.9  Iris-virginica

[149 rows x 3 columns]

In [84]:
df.to_csv('iris_copy',sep = ';',
          index = False)
df_index = pd.read_csv('iris_copy',sep = ';')
df_index

     5.1  3.5  1.4  0.2     Iris-setosa
0    4.9  3.0  1.4  0.2     Iris-setosa
1    4.7  3.2  1.3  0.2     Iris-setosa
2    4.6  3.1  1.5  0.2     Iris-setosa
3    5.0  3.6  1.4  0.2     Iris-setosa
4    5.4  3.9  1.7  0.4     Iris-setosa
..   ...  ...  ...  ...             ...
144  6.7  3.0  5.2  2.3  Iris-virginica
145  6.3  2.5  5.0  1.9  Iris-virginica
146  6.5  3.0  5.2  2.0  Iris-virginica
147  6.2  3.4  5.4  2.3  Iris-virginica
148  5.9  3.0  5.1  1.8  Iris-virginica

[149 rows x 5 columns]

In [85]:
df.to_csv('iris_copy',sep = ';',
          index_label= 'index_rows')
df_index_label = pd.read_csv('iris_copy',sep = ';')
df_index_label

     index_rows  5.1  3.5  1.4  0.2     Iris-setosa
0             0  4.9  3.0  1.4  0.2     Iris-setosa
1             1  4.7  3.2  1.3  0.2     Iris-setosa
2             2  4.6  3.1  1.5  0.2     Iris-setosa
3             3  5.0  3.6  1.4  0.2     Iris-setosa
4             4  5.4  3.9  1.7  0.4     Iris-setosa
..          ...  ...  ...  ...  ...             ...
144         144  6.7  3.0  5.2  2.3  Iris-virginica
145         145  6.3  2.5  5.0  1.9  Iris-virginica
146         146  6.5  3.0  5.2  2.0  Iris-virginica
147         147  6.2  3.4  5.4  2.3  Iris-virginica
148         148  5.9  3.0  5.1  1.8  Iris-virginica

[149 rows x 6 columns]

In [86]:
df.to_csv('iris_copy',sep = ';',
          encoding= 'utf8')

## Чтение из SQL-таблиц

# Lesson 5. Индексы, доступ к данным

## Установка столбцов в качестве индексов и обратная операция

In [89]:
dict_array = {'col_1':[5,5,6,3,7],
              'col_2':[27,56,7,4,7],
              'col_3':[27,6,0,-4,7],
              'col_4':[27,61,75,2,37],
              'col_5':[3,1,7,5,7]}
df = pd.DataFrame(dict_array)
df

   col_1  col_2  col_3  col_4  col_5
0      5     27     27     27      3
1      5     56      6     61      1
2      6      7      0     75      7
3      3      4     -4      2      5
4      7      7      7     37      7

In [90]:
df.set_index('col_1')

       col_2  col_3  col_4  col_5
col_1
5         27     27     27      3
5         56      6     61      1
6          7      0     75      7
3          4     -4      2      5
7          7      7     37      7

In [91]:
df.set_index(['col_1','col_4'])

             col_2  col_3  col_5
col_1 col_4
5     27        27     27      3
      61        56      6      1
6     75         7      0      7
3     2          4     -4      5
7     37         7      7      7

In [ ]:
df.set_index(['col_1','col_4'],append=True) # Чтобы оставить старый индекс

               col_2  col_3  col_5
  col_1 col_4
0 5     27        27     27      3
1 5     61        56      6      1
2 6     75         7      0      7
3 3     2          4     -4      5
4 7     37         7      7      7

In [93]:
df

   col_1  col_2  col_3  col_4  col_5
0      5     27     27     27      3
1      5     56      6     61      1
2      6      7      0     75      7
3      3      4     -4      2      5
4      7      7      7     37      7

In [ ]:
df.set_index(['col_1','col_4'],append=True,inplace=True) # inplace нужен чтобы оставить изменения в таблице 
df

               col_2  col_3  col_5
  col_1 col_4
0 5     27        27     27      3
1 5     61        56      6      1
2 6     75         7      0      7
3 3     2          4     -4      5
4 7     37         7      7      7

In [96]:
df.reset_index(['col_4'])

         col_4  col_2  col_3  col_5
  col_1
0 5         27     27     27      3
1 5         61     56      6      1
2 6         75      7      0      7
3 3          2      4     -4      5
4 7         37      7      7      7

In [97]:
df.reset_index(inplace=True)
df

   level_0  col_1  col_4  col_2  col_3  col_5
0        0      5     27     27     27      3
1        1      5     61     56      6      1
2        2      6     75      7      0      7
3        3      3      2      4     -4      5
4        4      7     37      7      7      7

## Доступ к данным с помощью индексов строк и столбцов

In [99]:
d =         {'col_1':[5,5,6,3,7],
              'столбец_2':[27,56,7,4,7],
              'col 3':[27,6,0,-4,7],
              'col_4':[27,61,75,2,37]
              }
df = pd.DataFrame(d)
df

   col_1  столбец_2  col 3  col_4
0      5         27     27     27
1      5         56      6     61
2      6          7      0     75
3      3          4     -4      2
4      7          7      7     37

In [ ]:
df['col 3'] # Возвращает серию

0    27
1     6
2     0
3    -4
4     7
Name: col 3, dtype: int64

In [ ]:
df[['col 3']] # Возвращает датафрейм

   col 3
0     27
1      6
2      0
3     -4
4      7

In [103]:
df[['col 3','col_4']]

   col 3  col_4
0     27     27
1      6     61
2      0     75
3     -4      2
4      7     37

In [104]:
df[['col 3','col_4']] = 1
df

   col_1  столбец_2  col 3  col_4
0      5         27      1      1
1      5         56      1      1
2      6          7      1      1
3      3          4      1      1
4      7          7      1      1

In [105]:
df['NEW_COL'] = 2
df

   col_1  столбец_2  col 3  col_4  NEW_COL
0      5         27      1      1        2
1      5         56      1      1        2
2      6          7      1      1        2
3      3          4      1      1        2
4      7          7      1      1        2

In [107]:
df['NEW_COL_1'] = df['col 3']
df

   col_1  столбец_2  col 3  col_4  NEW_COL  NEW_COL_1
0      5         27      1      1        2          1
1      5         56      1      1        2          1
2      6          7      1      1        2          1
3      3          4      1      1        2          1
4      7          7      1      1        2          1

In [108]:
del df['NEW_COL_1']

In [110]:
df[[False,True,True,False,True]]

   col_1  столбец_2  col 3  col_4  NEW_COL
1      5         56      1      1        2
2      6          7      1      1        2
4      7          7      1      1        2

In [ ]:
df[[False,True,True,False,True]] = 100

In [112]:
df

   col_1  столбец_2  col 3  col_4  NEW_COL
0      5         27      1      1        2
1    100        100    100    100      100
2    100        100    100    100      100
3      3          4      1      1        2
4    100        100    100    100      100

In [113]:
df[[False,True,True,False,True]]['столбец_2']

1    100
2    100
4    100
Name: столбец_2, dtype: int64

In [114]:
df.col_1

0      5
1    100
2    100
3      3
4    100
Name: col_1, dtype: int64

In [115]:
df.столбец_2

0     27
1    100
2    100
3      4
4    100
Name: столбец_2, dtype: int64

In [118]:
df.col 3

SyntaxError: invalid syntax (3887910251.py, line 1)

# Lesson 4. Индексы строк и столбцов

## Создание индекса

In [134]:
list_index = list('qwqityui')

In [135]:
index_data = pd.Index(list_index,
                      name = 'rows')
index_data

Index(['q', 'w', 'q', 'i', 't', 'y', 'u', 'i'], dtype='object', name='rows')

In [122]:
list_index = [0,1,2,3,4,5,6,7]
index_data = pd.Index(list_index,
                      dtype=np.float32,
                      name = 'rows')
index_data

Float64Index([0.0, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0], dtype='float64', name='rows')

In [136]:
column_data = pd.Index(['col_1','col_2','col_3'],
                       name = 'cols')
column_data

Index(['col_1', 'col_2', 'col_3'], dtype='object', name='cols')

In [137]:
df_data = pd.DataFrame({'col_1':[1,2,3,4,5,6,7,8],
                        'col_2':[5,6,7,8,1,2,3,4],
                        'col_3':[9,10,11,12,5,6,7,8]},
                        index=index_data,
                        columns=column_data)
df_data

cols  col_1  col_2  col_3
rows
q         1      5      9
w         2      6     10
q         3      7     11
i         4      8     12
t         5      1      5
y         6      2      6
u         7      3      7
i         8      4      8

## Свойства и методы индекса

In [126]:
df = pd.DataFrame({f'c_{i}':np.arange(1000)*i for i in range(100)})
df

,c_0,c_1,c_2,c_3,c_4,c_5,c_6,c_7,c_8,c_9,...,c_90,c_91,c_92,c_93,c_94,c_95,c_96,c_97,c_98,c_99
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
2,0,2,4,6,8,10,12,14,16,18,...,180,182,184,186,188,190,192,194,196,198
3,0,3,6,9,12,15,18,21,24,27,...,270,273,276,279,282,285,288,291,294,297
4,0,4,8,12,16,20,24,28,32,36,...,360,364,368,372,376,380,384,388,392,396
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,0,995,1990,2985,3980,4975,5970,6965,7960,8955,...,89550,90545,91540,92535,93530,94525,95520,96515,97510,98505
996,0,996,1992,2988,3984,4980,5976,6972,7968,8964,...,89640,90636,91632,92628,93624,94620,95616,96612,97608,98604
997,0,997,1994,2991,3988,4985,5982,6979,7976,8973,...,89730,90727,91724,92721,93718,94715,95712,96709,97706,98703
998,0,998,1996,2994,3992,4990,5988,6986,7984,8982,...,89820,90818,91816,92814,93812,94810,95808,96806,97804,98802
999,0,999,1998,2997,3996,4995,5994,6993,7992,8991,...,89910,90909,91908,92907,93906,94905,95904,96903,97902,98901

In [127]:
index = df.index
index

RangeIndex(start=0, stop=1000, step=1)

In [128]:
columns = df.columns
columns

Index(['c_0', 'c_1', 'c_2', 'c_3', 'c_4', 'c_5', 'c_6', 'c_7', 'c_8', 'c_9',
       'c_10', 'c_11', 'c_12', 'c_13', 'c_14', 'c_15', 'c_16', 'c_17', 'c_18',
       'c_19', 'c_20', 'c_21', 'c_22', 'c_23', 'c_24', 'c_25', 'c_26', 'c_27',
       'c_28', 'c_29', 'c_30', 'c_31', 'c_32', 'c_33', 'c_34', 'c_35', 'c_36',
       'c_37', 'c_38', 'c_39', 'c_40', 'c_41', 'c_42', 'c_43', 'c_44', 'c_45',
       'c_46', 'c_47', 'c_48', 'c_49', 'c_50', 'c_51', 'c_52', 'c_53', 'c_54',
       'c_55', 'c_56', 'c_57', 'c_58', 'c_59', 'c_60', 'c_61', 'c_62', 'c_63',
       'c_64', 'c_65', 'c_66', 'c_67', 'c_68', 'c_69', 'c_70', 'c_71', 'c_72',
       'c_73', 'c_74', 'c_75', 'c_76', 'c_77', 'c_78', 'c_79', 'c_80', 'c_81',
       'c_82', 'c_83', 'c_84', 'c_85', 'c_86', 'c_87', 'c_88', 'c_89', 'c_90',
       'c_91', 'c_92', 'c_93', 'c_94', 'c_95', 'c_96', 'c_97', 'c_98', 'c_99'],
      dtype='object')

In [ ]:
## Можно менять и названия столбцов
df.columns = [...] # внутри новое название каждого столбца

In [129]:
df

,c_0,c_1,c_2,c_3,c_4,c_5,c_6,c_7,c_8,c_9,...,c_90,c_91,c_92,c_93,c_94,c_95,c_96,c_97,c_98,c_99
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
2,0,2,4,6,8,10,12,14,16,18,...,180,182,184,186,188,190,192,194,196,198
3,0,3,6,9,12,15,18,21,24,27,...,270,273,276,279,282,285,288,291,294,297
4,0,4,8,12,16,20,24,28,32,36,...,360,364,368,372,376,380,384,388,392,396
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,0,995,1990,2985,3980,4975,5970,6965,7960,8955,...,89550,90545,91540,92535,93530,94525,95520,96515,97510,98505
996,0,996,1992,2988,3984,4980,5976,6972,7968,8964,...,89640,90636,91632,92628,93624,94620,95616,96612,97608,98604
997,0,997,1994,2991,3988,4985,5982,6979,7976,8973,...,89730,90727,91724,92721,93718,94715,95712,96709,97706,98703
998,0,998,1996,2994,3992,4990,5988,6986,7984,8982,...,89820,90818,91816,92814,93812,94810,95808,96806,97804,98802
999,0,999,1998,2997,3996,4995,5994,6993,7992,8991,...,89910,90909,91908,92907,93906,94905,95904,96903,97902,98901

In [130]:
index.to_list()

[0,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 34,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50,
 51,
 52,
 53,
 54,
 55,
 56,
 57,
 58,
 59,
 60,
 61,
 62,
 63,
 64,
 65,
 66,
 67,
 68,
 69,
 70,
 71,
 72,
 73,
 74,
 75,
 76,
 77,
 78,
 79,
 80,
 81,
 82,
 83,
 84,
 85,
 86,
 87,
 88,
 89,
 90,
 91,
 92,
 93,
 94,
 95,
 96,
 97,
 98,
 99,
 100,
 101,
 102,
 103,
 104,
 105,
 106,
 107,
 108,
 109,
 110,
 111,
 112,
 113,
 114,
 115,
 116,
 117,
 118,
 119,
 120,
 121,
 122,
 123,
 124,
 125,
 126,
 127,
 128,
 129,
 130,
 131,
 132,
 133,
 134,
 135,
 136,
 137,
 138,
 139,
 140,
 141,
 142,
 143,
 144,
 145,
 146,
 147,
 148,
 149,
 150,
 151,
 152,
 153,
 154,
 155,
 156,
 157,
 158,
 159,
 160,
 161,
 162,
 163,
 164,
 165,
 166,
 167,
 168,
 169,
 170,
 171,
 172,
 173,
 174,
 175,
 176,
 177,
 178,
 179,
 180,
 181,
 182,
 183,
 184,
 185,
 186,
 187,
 188,
 189,
 190,
 191,
 192,
 193,
 194,
 195,
 196,
 197,
 198,
 199,
 200,
 201,
 202,
 203,
 204,
 205,
 206,
 207,
 208,
 209,
 210,
 211,
 212,
 213,
 214,
 215,
 216,
 217,
 218,
 219,
 220,
 221,
 222,
 223,
 224,
 225,
 226,
 227,
 228,
 229,
 230,
 231,
 232,
 233,
 234,
 235,
 236,
 237,
 238,
 239,
 240,
 241,
 242,
 243,
 244,
 245,
 246,
 247,
 248,
 249,
 250,
 251,
 252,
 253,
 254,
 255,
 256,
 257,
 258,
 259,
 260,
 261,
 262,
 263,
 264,
 265,
 266,
 267,
 268,
 269,
 270,
 271,
 272,
 273,
 274,
 275,
 276,
 277,
 278,
 279,
 280,
 281,
 282,
 283,
 284,
 285,
 286,
 287,
 288,
 289,
 290,
 291,
 292,
 293,
 294,
 295,
 296,
 297,
 298,
 299,
 300,
 301,
 302,
 303,
 304,
 305,
 306,
 307,
 308,
 309,
 310,
 311,
 312,
 313,
 314,
 315,
 316,
 317,
 318,
 319,
 320,
 321,
 322,
 323,
 324,
 325,
 326,
 327,
 328,
 329,
 330,
 331,
 332,
 333,
 334,
 335,
 336,
 337,
 338,
 339,
 340,
 341,
 342,
 343,
 344,
 345,
 346,
 347,
 348,
 349,
 350,
 351,
 352,
 353,
 354,
 355,
 356,
 357,
 358,
 359,
 360,
 361,
 362,
 363,
 364,
 365,
 366,
 367,
 368,
 369,
 370,
 371,
 372,
 373,
 374,
 375,
 376,
 377,
 378,
 379,
 380,
 381,
 382,
 383,
 384,
 385,
 386,
 387,
 388,
 389,
 390,
 391,
 392,
 393,
 394,
 395,
 396,
 397,
 398,
 399,
 400,
 401,
 402,
 403,
 404,
 405,
 406,
 407,
 408,
 409,
 410,
 411,
 412,
 413,
 414,
 415,
 416,
 417,
 418,
 419,
 420,
 421,
 422,
 423,
 424,
 425,
 426,
 427,
 428,
 429,
 430,
 431,
 432,
 433,
 434,
 435,
 436,
 437,
 438,
 439,
 440,
 441,
 442,
 443,
 444,
 445,
 446,
 447,
 448,
 449,
 450,
 451,
 452,
 453,
 454,
 455,
 456,
 457,
 458,
 459,
 460,
 461,
 462,
 463,
 464,
 465,
 466,
 467,
 468,
 469,
 470,
 471,
 472,
 473,
 474,
 475,
 476,
 477,
 478,
 479,
 480,
 481,
 482,
 483,
 484,
 485,
 486,
 487,
 488,
 489,
 490,
 491,
 492,
 493,
 494,
 495,
 496,
 497,
 498,
 499,
 500,
 501,
 502,
 503,
 504,
 505,
 506,
 507,
 508,
 509,
 510,
 511,
 512,
 513,
 514,
 515,
 516,
 517,
 518,
 519,
 520,
 521,
 522,
 523,
 524,
 525,
 526,
 527,
 528,
 529,
 530,
 531,
 532,
 533,
 534,
 535,
 536,
 537,
 538,
 539,
 540,
 541,
 542,
 543,
 544,
 545,
 546,
 547,
 548,
 549,
 550,
 551,
 552,
 553,
 554,
 555,
 556,
 557,
 558,
 559,
 560,
 561,
 562,
 563,
 564,
 565,
 566,
 567,
 568,
 569,
 570,
 571,
 572,
 573,
 574,
 575,
 576,
 577,
 578,
 579,
 580,
 581,
 582,
 583,
 584,
 585,
 586,
 587,
 588,
 589,
 590,
 591,
 592,
 593,
 594,
 595,
 596,
 597,
 598,
 599,
 600,
 601,
 602,
 603,
 604,
 605,
 606,
 607,
 608,
 609,
 610,
 611,
 612,
 613,
 614,
 615,
 616,
 617,
 618,
 619,
 620,
 621,
 622,
 623,
 624,
 625,
 626,
 627,
 628,
 629,
 630,
 631,
 632,
 633,
 634,
 635,
 636,
 637,
 638,
 639,
 640,
 641,
 642,
 643,
 644,
 645,
 646,
 647,
 648,
 649,
 650,
 651,
 652,
 653,
 654,
 655,
 656,
 657,
 658,
 659,
 660,
 661,
 662,
 663,
 664,
 665,
 666,
 667,
 668,
 669,
 670,
 671,
 672,
 673,
 674,
 675,
 676,
 677,
 678,
 679,
 680,
 681,
 682,
 683,
 684,
 685,
 686,
 687,
 688,
 689,
 690,
 691,
 692,
 693,
 694,
 695,
 696,
 697,
 698,
 699,
 700,
 701,
 702,
 703,
 704,
 705,
 706,
 707,
 708,
 709,
 710,
 711,
 712,
 713,
 714,
 715,
 716,
 717,
 718,
 719,
 720,
 721,
 722,
 723,
 724,
 725,
 726,
 727,
 728,
 729,
 730,
 731,
 732,
 733,
 734,
 735,
 736,
 737,
 738,
 739,
 740,
 741,
 742,
 743,
 744,
 745,
 746,
 747,
 748,
 749,
 750,
 751,
 752,
 753,
 754,
 755,
 756,
 757,
 758,
 759,
 760,
 761,
 762,
 763,
 764,
 765,
 766,
 767,
 768,
 769,
 770,
 771,
 772,
 773,
 774,
 775,
 776,
 777,
 778,
 779,
 780,
 781,
 782,
 783,
 784,
 785,
 786,
 787,
 788,
 789,
 790,
 791,
 792,
 793,
 794,
 795,
 796,
 797,
 798,
 799,
 800,
 801,
 802,
 803,
 804,
 805,
 806,
 807,
 808,
 809,
 810,
 811,
 812,
 813,
 814,
 815,
 816,
 817,
 818,
 819,
 820,
 821,
 822,
 823,
 824,
 825,
 826,
 827,
 828,
 829,
 830,
 831,
 832,
 833,
 834,
 835,
 836,
 837,
 838,
 839,
 840,
 841,
 842,
 843,
 844,
 845,
 846,
 847,
 848,
 849,
 850,
 851,
 852,
 853,
 854,
 855,
 856,
 857,
 858,
 859,
 860,
 861,
 862,
 863,
 864,
 865,
 866,
 867,
 868,
 869,
 870,
 871,
 872,
 873,
 874,
 875,
 876,
 877,
 878,
 879,
 880,
 881,
 882,
 883,
 884,
 885,
 886,
 887,
 888,
 889,
 890,
 891,
 892,
 893,
 894,
 895,
 896,
 897,
 898,
 899,
 900,
 901,
 902,
 903,
 904,
 905,
 906,
 907,
 908,
 909,
 910,
 911,
 912,
 913,
 914,
 915,
 916,
 917,
 918,
 919,
 920,
 921,
 922,
 923,
 924,
 925,
 926,
 927,
 928,
 929,
 930,
 931,
 932,
 933,
 934,
 935,
 936,
 937,
 938,
 939,
 940,
 941,
 942,
 943,
 944,
 945,
 946,
 947,
 948,
 949,
 950,
 951,
 952,
 953,
 954,
 955,
 956,
 957,
 958,
 959,
 960,
 961,
 962,
 963,
 964,
 965,
 966,
 967,
 968,
 969,
 970,
 971,
 972,
 973,
 974,
 975,
 976,
 977,
 978,
 979,
 980,
 981,
 982,
 983,
 984,
 985,
 986,
 987,
 988,
 989,
 990,
 991,
 992,
 993,
 994,
 995,
 996,
 997,
 998,
 999]

In [131]:
columns.to_list()

['c_0',
 'c_1',
 'c_2',
 'c_3',
 'c_4',
 'c_5',
 'c_6',
 'c_7',
 'c_8',
 'c_9',
 'c_10',
 'c_11',
 'c_12',
 'c_13',
 'c_14',
 'c_15',
 'c_16',
 'c_17',
 'c_18',
 'c_19',
 'c_20',
 'c_21',
 'c_22',
 'c_23',
 'c_24',
 'c_25',
 'c_26',
 'c_27',
 'c_28',
 'c_29',
 'c_30',
 'c_31',
 'c_32',
 'c_33',
 'c_34',
 'c_35',
 'c_36',
 'c_37',
 'c_38',
 'c_39',
 'c_40',
 'c_41',
 'c_42',
 'c_43',
 'c_44',
 'c_45',
 'c_46',
 'c_47',
 'c_48',
 'c_49',
 'c_50',
 'c_51',
 'c_52',
 'c_53',
 'c_54',
 'c_55',
 'c_56',
 'c_57',
 'c_58',
 'c_59',
 'c_60',
 'c_61',
 'c_62',
 'c_63',
 'c_64',
 'c_65',
 'c_66',
 'c_67',
 'c_68',
 'c_69',
 'c_70',
 'c_71',
 'c_72',
 'c_73',
 'c_74',
 'c_75',
 'c_76',
 'c_77',
 'c_78',
 'c_79',
 'c_80',
 'c_81',
 'c_82',
 'c_83',
 'c_84',
 'c_85',
 'c_86',
 'c_87',
 'c_88',
 'c_89',
 'c_90',
 'c_91',
 'c_92',
 'c_93',
 'c_94',
 'c_95',
 'c_96',
 'c_97',
 'c_98',
 'c_99']

In [132]:
index.to_numpy()

array([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
        13,  14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,
        26,  27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,
        39,  40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,
        52,  53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,
        65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,
        78,  79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,
        91,  92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103,
       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116,
       117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129,
       130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142,
       143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
       156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168,
       169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181,
       182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194,
       195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207,
       208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220,
       221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233,
       234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246,
       247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259,
       260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272,
       273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285,
       286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298,
       299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311,
       312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324,
       325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337,
       338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350,
       351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363,
       364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376,
       377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389,
       390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402,
       403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415,
       416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428,
       429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441,
       442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454,
       455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467,
       468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480,
       481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493,
       494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506,
       507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519,
       520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532,
       533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545,
       546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558,
       559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571,
       572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 584,
       585, 586, 587, 588, 589, 590, 591, 592, 593, 594, 595, 596, 597,
       598, 599, 600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610,
       611, 612, 613, 614, 615, 616, 617, 618, 619, 620, 621, 622, 623,
       624, 625, 626, 627, 628, 629, 630, 631, 632, 633, 634, 635, 636,
       637, 638, 639, 640, 641, 642, 643, 644, 645, 646, 647, 648, 649,
       650, 651, 652, 653, 654, 655, 656, 657, 658, 659, 660, 661, 662,
       663, 664, 665, 666, 667, 668, 669, 670, 671, 672, 673, 674, 675,
       676, 677, 678, 679, 680, 681, 682, 683, 684, 685, 686, 687, 688,
       689, 690, 691, 692, 693, 694, 695, 696, 697, 698, 699, 700, 701,
       702, 703, 704, 705, 706, 707, 708, 709, 710, 711, 712, 713, 714,
       715, 716, 717, 718, 719, 720, 721, 722, 723, 724, 725, 726, 727,
       728, 729, 730, 731, 732, 733, 734, 735, 736, 737, 738, 739, 740,
       741, 742, 743, 744, 745, 746, 747, 748, 749, 750, 751, 752, 753,
       754, 755, 756, 757, 758, 759, 760, 761, 762, 763, 764, 765, 766,
       767, 768, 769, 770, 771, 772, 773, 774, 775, 776, 777, 778, 779,
       780, 781, 782, 783, 784, 785, 786, 787, 788, 789, 790, 791, 792,
       793, 794, 795, 796, 797, 798, 799, 800, 801, 802, 803, 804, 805,
       806, 807, 808, 809, 810, 811, 812, 813, 814, 815, 816, 817, 818,
       819, 820, 821, 822, 823, 824, 825, 826, 827, 828, 829, 830, 831,
       832, 833, 834, 835, 836, 837, 838, 839, 840, 841, 842, 843, 844,
       845, 846, 847, 848, 849, 850, 851, 852, 853, 854, 855, 856, 857,
       858, 859, 860, 861, 862, 863, 864, 865, 866, 867, 868, 869, 870,
       871, 872, 873, 874, 875, 876, 877, 878, 879, 880, 881, 882, 883,
       884, 885, 886, 887, 888, 889, 890, 891, 892, 893, 894, 895, 896,
       897, 898, 899, 900, 901, 902, 903, 904, 905, 906, 907, 908, 909,
       910, 911, 912, 913, 914, 915, 916, 917, 918, 919, 920, 921, 922,
       923, 924, 925, 926, 927, 928, 929, 930, 931, 932, 933, 934, 935,
       936, 937, 938, 939, 940, 941, 942, 943, 944, 945, 946, 947, 948,
       949, 950, 951, 952, 953, 954, 955, 956, 957, 958, 959, 960, 961,
       962, 963, 964, 965, 966, 967, 968, 969, 970, 971, 972, 973, 974,
       975, 976, 977, 978, 979, 980, 981, 982, 983, 984, 985, 986, 987,
       988, 989, 990, 991, 992, 993, 994, 995, 996, 997, 998, 999])

In [133]:
columns.to_numpy()

array(['c_0', 'c_1', 'c_2', 'c_3', 'c_4', 'c_5', 'c_6', 'c_7', 'c_8',
       'c_9', 'c_10', 'c_11', 'c_12', 'c_13', 'c_14', 'c_15', 'c_16',
       'c_17', 'c_18', 'c_19', 'c_20', 'c_21', 'c_22', 'c_23', 'c_24',
       'c_25', 'c_26', 'c_27', 'c_28', 'c_29', 'c_30', 'c_31', 'c_32',
       'c_33', 'c_34', 'c_35', 'c_36', 'c_37', 'c_38', 'c_39', 'c_40',
       'c_41', 'c_42', 'c_43', 'c_44', 'c_45', 'c_46', 'c_47', 'c_48',
       'c_49', 'c_50', 'c_51', 'c_52', 'c_53', 'c_54', 'c_55', 'c_56',
       'c_57', 'c_58', 'c_59', 'c_60', 'c_61', 'c_62', 'c_63', 'c_64',
       'c_65', 'c_66', 'c_67', 'c_68', 'c_69', 'c_70', 'c_71', 'c_72',
       'c_73', 'c_74', 'c_75', 'c_76', 'c_77', 'c_78', 'c_79', 'c_80',
       'c_81', 'c_82', 'c_83', 'c_84', 'c_85', 'c_86', 'c_87', 'c_88',
       'c_89', 'c_90', 'c_91', 'c_92', 'c_93', 'c_94', 'c_95', 'c_96',
       'c_97', 'c_98', 'c_99'], dtype=object)

In [138]:
index_data = df_data.index
columns = df_data.columns

In [139]:
print(f'Индексы строк => {index_data}')
print(f'Индексы столбоцов => {column_data}')

Индексы строк => Index(['q', 'w', 'q', 'i', 't', 'y', 'u', 'i'], dtype='object', name='rows')
Индексы столбоцов => Index(['col_1', 'col_2', 'col_3'], dtype='object', name='cols')

In [141]:
index_data.unique(),column_data.unique()

(Index(['q', 'w', 'i', 't', 'y', 'u'], dtype='object', name='rows'),
 Index(['col_1', 'col_2', 'col_3'], dtype='object', name='cols'))

In [142]:
index_data.nunique(),column_data.nunique()

(6, 3)

In [143]:
index_data.is_unique, column_data.is_unique

(False, True)

In [144]:
print(index_data)
print(index_data.duplicated())

Index(['q', 'w', 'q', 'i', 't', 'y', 'u', 'i'], dtype='object', name='rows')
[False False  True False False False False  True]

In [146]:
print(index_data.name)
print(column_data.name)

rows
cols

In [147]:
index_data.name = 'rows_new'
column_data.name = 'cols_new'

In [148]:
df_data

cols_new  col_1  col_2  col_3
rows_new
q             1      5      9
w             2      6     10
q             3      7     11
i             4      8     12
t             5      1      5
y             6      2      6
u             7      3      7
i             8      4      8

## Метод rename()

In [ ]:
df_data.rename(columns={'col_1':'col_11',
                        'col_2':'col_22',
                        'col_3':'col_33',
                        'col_4':'col_44'}) # Возвращает новый DataFrame

cols_new  col_11  col_22  col_33
rows_new
q              1       5       9
w              2       6      10
q              3       7      11
i              4       8      12
t              5       1       5
y              6       2       6
u              7       3       7
i              8       4       8

In [ ]:
df_data.rename({'col_1':'col_11',
                        'col_2':'col_22',
                        'col_3':'col_33'},axis=1) # Возвращает новый DataFrame

cols_new  col_11  col_22  col_33
rows_new
q              1       5       9
w              2       6      10
q              3       7      11
i              4       8      12
t              5       1       5
y              6       2       6
u              7       3       7
i              8       4       8

In [154]:
df_data.rename(str.upper,axis=1,inplace=True) # Возвращает новый DataFrame
df_data

cols_new  COL_1  COL_2  COL_3
rows_new
q             1      5      9
w             2      6     10
q             3      7     11
i             4      8     12
t             5      1      5
y             6      2      6
u             7      3      7
i             8      4      8

## Пропуски в индексах

In [155]:
index = pd.Index([1,np.nan,3,np.nan,5])
index

Float64Index([1.0, nan, 3.0, nan, 5.0], dtype='float64')

In [156]:
df_nan = pd.DataFrame(np.arange(5),index=index)
df_nan

     0
1.0  0
NaN  1
3.0  2
NaN  3
5.0  4

In [157]:
df_nan.index.hasnans

True

In [158]:
df_nan.index.isna()

array([False,  True, False,  True, False])

In [160]:
df_nan.index.dropna() # не меняет исходную индексация

Float64Index([1.0, 3.0, 5.0], dtype='float64')

# Lesson 6. Мультииндекс

In [161]:
array = [[1,1,2,2],['row_1','row_2','row_3','row_4']]
multii_array = pd.MultiIndex.from_arrays(array, names=['level_0','level_1'])
multii_array

MultiIndex([(1, 'row_1'),
            (1, 'row_2'),
            (2, 'row_3'),
            (2, 'row_4')],
           names=['level_0', 'level_1'])

In [162]:
df_index = pd.DataFrame([[4,3,2,1],
                         [4,3,2,1],
                         [4,3,2,1],
                         [4,3,2,1]],index = multii_array)
df_columns = pd.DataFrame([[4,3,2,1],
                         [4,3,2,1],
                         [4,3,2,1],
                         [4,3,2,1]],columns= multii_array)

print(df_index, end='\n\n')
print(df_columns)

                 0  1  2  3
level_0 level_1
1       row_1    4  3  2  1
        row_2    4  3  2  1
2       row_3    4  3  2  1
        row_4    4  3  2  1

level_0     1           2
level_1 row_1 row_2 row_3 row_4
0           4     3     2     1
1           4     3     2     1
2           4     3     2     1
3           4     3     2     1

In [163]:
level_0 = ['row_1','row_2']
level_1 = [1,2,3]
multii_product = pd.MultiIndex.from_product([level_0,level_1],names = ['level_0','level_1'])
multii_product

MultiIndex([('row_1', 1),
            ('row_1', 2),
            ('row_1', 3),
            ('row_2', 1),
            ('row_2', 2),
            ('row_2', 3)],
           names=['level_0', 'level_1'])

In [165]:
df = pd.DataFrame({'col_1':[6,5,4,3,2,1],
                    'col_2':[6,5,4,3,2,1],
                    'col_3':[6,5,4,3,2,1],
                    'col_4':[6,5,4,3,2,1]},index = multii_product)
df

                 col_1  col_2  col_3  col_4
level_0 level_1
row_1   1            6      6      6      6
        2            5      5      5      5
        3            4      4      4      4
row_2   1            3      3      3      3
        2            2      2      2      2
        3            1      1      1      1

In [166]:
tuples = [(1,'row_1'),(1,'row_2'),(1,'row_3'),(2,'row_1'),(2,'row_2'),(2,'row_3'),]

multii_tuples = pd.MultiIndex.from_tuples(tuples,
                                          names=['level_0','level_1'])
multii_tuples

MultiIndex([(1, 'row_1'),
            (1, 'row_2'),
            (1, 'row_3'),
            (2, 'row_1'),
            (2, 'row_2'),
            (2, 'row_3')],
           names=['level_0', 'level_1'])

In [167]:
df = pd.DataFrame({'col_1':[6,5,4,3,2,1],
                    'col_2':[6,5,4,3,2,1],
                    'col_3':[6,5,4,3,2,1],
                    'col_4':[6,5,4,3,2,1]},index = multii_tuples)
df

                 col_1  col_2  col_3  col_4
level_0 level_1
1       row_1        6      6      6      6
        row_2        5      5      5      5
        row_3        4      4      4      4
2       row_1        3      3      3      3
        row_2        2      2      2      2
        row_3        1      1      1      1

## Свойства и методы мультииндекса

In [168]:
print(df.index, end='\n\n')
print(df.columns)

MultiIndex([(1, 'row_1'),
            (1, 'row_2'),
            (1, 'row_3'),
            (2, 'row_1'),
            (2, 'row_2'),
            (2, 'row_3')],
           names=['level_0', 'level_1'])

Index(['col_1', 'col_2', 'col_3', 'col_4'], dtype='object')

In [169]:
df.index.nlevels # число уровней

2

In [170]:
df.index.levshape # Кортеж с длиной каждого уровня

(2, 3)

In [171]:
df.index.names

FrozenList(['level_0', 'level_1'])

In [ ]:
df.index.names = ['new_level_0','new_level_1'] # Изменение имен индексов
df.index.names

FrozenList(['new_level_0', 'new_level_1'])

In [174]:
df.index.set_names(['level_0','level_1'],inplace=True)
df

                 col_1  col_2  col_3  col_4
level_0 level_1
1       row_1        6      6      6      6
        row_2        5      5      5      5
        row_3        4      4      4      4
2       row_1        3      3      3      3
        row_2        2      2      2      2
        row_3        1      1      1      1

In [176]:
df.index.set_names('new_level_0',level=1,inplace=True)
df

                     col_1  col_2  col_3  col_4
level_0 new_level_0
1       row_1            6      6      6      6
        row_2            5      5      5      5
        row_3            4      4      4      4
2       row_1            3      3      3      3
        row_2            2      2      2      2
        row_3            1      1      1      1

In [177]:
df.index.levels

FrozenList([[1, 2], ['row_1', 'row_2', 'row_3']])

In [178]:
multii_product

MultiIndex([('row_1', 1),
            ('row_1', 2),
            ('row_1', 3),
            ('row_2', 1),
            ('row_2', 2),
            ('row_2', 3)],
           names=['level_0', 'level_1'])

In [179]:
df.index = multii_product
df.index

MultiIndex([('row_1', 1),
            ('row_1', 2),
            ('row_1', 3),
            ('row_2', 1),
            ('row_2', 2),
            ('row_2', 3)],
           names=['level_0', 'level_1'])

In [ ]:
new_index = df.index.set_levels([[4,5,6],['q','w','r','t','p']])
print(new_index)
print(new_index.levels) # Элементы не учавствующие в замене все равно присутствуют в мультииндексе

MultiIndex([(4, 'q'),
            (4, 'w'),
            (4, 'r'),
            (5, 'q'),
            (5, 'w'),
            (5, 'r')],
           names=['level_0', 'level_1'])
[[4, 5, 6], ['q', 'w', 'r', 't', 'p']]

In [182]:
df

                 col_1  col_2  col_3  col_4
level_0 level_1
row_1   1            6      6      6      6
        2            5      5      5      5
        3            4      4      4      4
row_2   1            3      3      3      3
        2            2      2      2      2
        3            1      1      1      1

In [183]:
new_index = df.index.set_levels(['q','w','r','t'],level = 0)
print(new_index)
print(new_index.levels) # Элементы не учавствующие в замене все равно присутствуют в мультииндексе

MultiIndex([('q', 1),
            ('q', 2),
            ('q', 3),
            ('w', 1),
            ('w', 2),
            ('w', 3)],
           names=['level_0', 'level_1'])
[['q', 'w', 'r', 't'], [1, 2, 3]]

In [184]:
new_df =  df.reset_index()
new_df

  level_0  level_1  col_1  col_2  col_3  col_4
0   row_1        1      6      6      6      6
1   row_1        2      5      5      5      5
2   row_1        3      4      4      4      4
3   row_2        1      3      3      3      3
4   row_2        2      2      2      2      2
5   row_2        3      1      1      1      1

In [186]:
df.reset_index(['level_0'],inplace = True)

In [187]:
df

        level_0  col_1  col_2  col_3  col_4
level_1
1         row_1      6      6      6      6
2         row_1      5      5      5      5
3         row_1      4      4      4      4
1         row_2      3      3      3      3
2         row_2      2      2      2      2
3         row_2      1      1      1      1

In [189]:
df.index = multii_product
df

                level_0  col_1  col_2  col_3  col_4
level_0 level_1
row_1   1         row_1      6      6      6      6
        2         row_1      5      5      5      5
        3         row_1      4      4      4      4
row_2   1         row_2      3      3      3      3
        2         row_2      2      2      2      2
        3         row_2      1      1      1      1

In [190]:
new_index = df.index.droplevel()
print(df.index)
print(new_index)

MultiIndex([('row_1', 1),
            ('row_1', 2),
            ('row_1', 3),
            ('row_2', 1),
            ('row_2', 2),
            ('row_2', 3)],
           names=['level_0', 'level_1'])
Int64Index([1, 2, 3, 1, 2, 3], dtype='int64', name='level_1')

In [191]:
new_index = df.index.droplevel(level=1)
print(df.index)
print(new_index)

MultiIndex([('row_1', 1),
            ('row_1', 2),
            ('row_1', 3),
            ('row_2', 1),
            ('row_2', 2),
            ('row_2', 3)],
           names=['level_0', 'level_1'])
Index(['row_1', 'row_1', 'row_1', 'row_2', 'row_2', 'row_2'], dtype='object', name='level_0')

In [ ]:
new_index = df.index.droplevel(['level_1']) # нельзя удалять все уровни, тк будет ошибка
print(df.index)
print(new_index)

MultiIndex([('row_1', 1),
            ('row_1', 2),
            ('row_1', 3),
            ('row_2', 1),
            ('row_2', 2),
            ('row_2', 3)],
           names=['level_0', 'level_1'])
Index(['row_1', 'row_1', 'row_1', 'row_2', 'row_2', 'row_2'], dtype='object', name='level_0')

# Lesson 7. Арифмитические операции

In [ ]:
df_1 = pd.DataFrame({'col_1':[5,6,np.nan,3,7],
                     'col_2':[27,6,7,40,70],
                     'col_3':[1,45,6,62,7]},
                     index = ['row_1','row_2','row_3','row_4','row_5'])
df_1
df_2 = pd.DataFrame({'col_1':[5,6,7,np.nan,3],
                     'col_2':[27,6,7,4,7],
                     'col_3':[1,45,6,62,7]},
                     index = ['row_1','row_2','row_3','row_4','row_5'])
df_2
series = pd.Series([5,6,np.nan,1,7],
                   index = ['row_10','col_2','row_3','row_4','row_5'])
series

       col_1  col_2  col_3
row_1    5.0     27      1
row_2    6.0      6     45
row_3    NaN      7      6
row_4    3.0     40     62
row_5    7.0     70      7

In [194]:
df_2 = pd.DataFrame({'col_1':[5,6,7,np.nan,3],
                     'col_2':[27,6,7,4,7],
                     'col_3':[1,45,6,62,7]},
                     index = ['row_1','row_2','row_3','row_4','row_5'])
df_2

       col_1  col_2  col_3
row_1    5.0     27      1
row_2    6.0      6     45
row_3    7.0      7      6
row_4    NaN      4     62
row_5    3.0      7      7

In [196]:
series = pd.Series([5,6,np.nan,1,7],
                   index = ['row_10','col_2','row_3','row_4','row_5'])
series

row_10    5.0
col_2     6.0
row_3     NaN
row_4     1.0
row_5     7.0
dtype: float64

In [197]:
print(np.nan + np.nan)
print(5*np.nan)

nan
nan

In [ ]:
series +5

(row_10    10.0
 col_2     11.0
 row_3      NaN
 row_4      6.0
 row_5     12.0
 dtype: float64,
 row_10   NaN
 col_2    NaN
 row_3    NaN
 row_4    NaN
 row_5    NaN
 dtype: float64)

In [ ]:
series+np.nan

row_10   NaN
col_2    NaN
row_3    NaN
row_4    NaN
row_5    NaN
dtype: float64

In [201]:
series+[1,2,3,4,5]

row_10     6.0
col_2      8.0
row_3      NaN
row_4      5.0
row_5     12.0
dtype: float64

## Арифметические операции между Series и Series

In [203]:
series, df_1['col_1']

(row_10    5.0
 col_2     6.0
 row_3     NaN
 row_4     1.0
 row_5     7.0
 dtype: float64,
 row_1    5.0
 row_2    6.0
 row_3    NaN
 row_4    3.0
 row_5    7.0
 Name: col_1, dtype: float64)

In [204]:
series+df_1['col_1']

col_2      NaN
row_1      NaN
row_10     NaN
row_2      NaN
row_3      NaN
row_4      4.0
row_5     14.0
dtype: float64

## Арифметические операции с DataFrame

In [205]:
df_1

       col_1  col_2  col_3
row_1    5.0     27      1
row_2    6.0      6     45
row_3    NaN      7      6
row_4    3.0     40     62
row_5    7.0     70      7

In [206]:
df_1 + 10

       col_1  col_2  col_3
row_1   15.0     37     11
row_2   16.0     16     55
row_3    NaN     17     16
row_4   13.0     50     72
row_5   17.0     80     17

In [207]:
df_1 + np.nan

       col_1  col_2  col_3
row_1    NaN    NaN    NaN
row_2    NaN    NaN    NaN
row_3    NaN    NaN    NaN
row_4    NaN    NaN    NaN
row_5    NaN    NaN    NaN

In [208]:
df_1 + [1,2,3]

       col_1  col_2  col_3
row_1    6.0     29      4
row_2    7.0      8     48
row_3    NaN      9      9
row_4    4.0     42     65
row_5    8.0     72     10

## Арифметические операции между DataFrame и DataFrame

In [209]:
df_3 = df_1.head(3)
df_4 = df_1[['col_1','col_2']]
print(df_3,end='\n\n')
print(df_4)

       col_1  col_2  col_3
row_1    5.0     27      1
row_2    6.0      6     45
row_3    NaN      7      6

       col_1  col_2
row_1    5.0     27
row_2    6.0      6
row_3    NaN      7
row_4    3.0     40
row_5    7.0     70

In [211]:
df_3+df_4 # Сначала идет выравнивание индексов, затем поэлементные арифметические операции

       col_1  col_2  col_3
row_1   10.0   54.0    NaN
row_2   12.0   12.0    NaN
row_3    NaN   14.0    NaN
row_4    NaN    NaN    NaN
row_5    NaN    NaN    NaN

## Специальные методы для выполнения арифметических операций

In [212]:
df_1.add(100)

       col_1  col_2  col_3
row_1  105.0    127    101
row_2  106.0    106    145
row_3    NaN    107    106
row_4  103.0    140    162
row_5  107.0    170    107

In [213]:
df_1.add([10,20,30])

       col_1  col_2  col_3
row_1   15.0     47     31
row_2   16.0     26     75
row_3    NaN     27     36
row_4   13.0     60     92
row_5   17.0     90     37

In [214]:
df_1.add(df_2)

       col_1  col_2  col_3
row_1   10.0     54      2
row_2   12.0     12     90
row_3    NaN     14     12
row_4    NaN     44    124
row_5   10.0     77     14

In [215]:
df_1.add([10,20,30],axis = 1)

       col_1  col_2  col_3
row_1   15.0     47     31
row_2   16.0     26     75
row_3    NaN     27     36
row_4   13.0     60     92
row_5   17.0     90     37

In [216]:
df_1.add([10,20,30,40,50],axis = 0)

       col_1  col_2  col_3
row_1   15.0     37     11
row_2   26.0     26     65
row_3    NaN     37     36
row_4   43.0     80    102
row_5   57.0    120     57

In [217]:
df_1.add(series,axis = 0)

        col_1  col_2  col_3
col_2     NaN    NaN    NaN
row_1     NaN    NaN    NaN
row_10    NaN    NaN    NaN
row_2     NaN    NaN    NaN
row_3     NaN    NaN    NaN
row_4     4.0   41.0   63.0
row_5    14.0   77.0   14.0

In [218]:
df_3 = df_1.head(3)
df_4 = df_1[['col_1','col_2']]
print(df_3,end='\n\n')
print(df_4)

       col_1  col_2  col_3
row_1    5.0     27      1
row_2    6.0      6     45
row_3    NaN      7      6

       col_1  col_2
row_1    5.0     27
row_2    6.0      6
row_3    NaN      7
row_4    3.0     40
row_5    7.0     70

In [219]:
df_3.add(df_4)

       col_1  col_2  col_3
row_1   10.0   54.0    NaN
row_2   12.0   12.0    NaN
row_3    NaN   14.0    NaN
row_4    NaN    NaN    NaN
row_5    NaN    NaN    NaN

In [ ]:
df_3.add(df_4,
         fill_value=10) # заменяет пропуски на NaN

       col_1  col_2  col_3
row_1   10.0   54.0   11.0
row_2   12.0   12.0   55.0
row_3    NaN   14.0   16.0
row_4   13.0   50.0    NaN
row_5   17.0   80.0    NaN

# Lesson 8. Операции сравнения

In [221]:
df_1 = pd.DataFrame({'col_1':[5,6,np.nan,3,7],
                     'col_2':[27,6,7,40,70],
                     'col_3':[1,45,6,62,7]},
                     index = ['row_1','row_2','row_3','row_4','row_5'])
df_1
df_2 = pd.DataFrame({'col_1':[5,6,7,np.nan,3],
                     'col_2':[27,6,7,4,7],
                     'col_3':[1,45,6,62,7]},
                     index = ['row_1','row_2','row_3','row_4','row_5'])
df_2
series = pd.Series([5,6,np.nan,1,7],
                   index = ['row_10','col_2','row_3','row_4','row_5'])
series

row_10    5.0
col_2     6.0
row_3     NaN
row_4     1.0
row_5     7.0
dtype: float64

In [222]:
np.nan == np.nan

False

In [223]:
np.nan < 100

False

In [224]:
series == 5

row_10     True
col_2     False
row_3     False
row_4     False
row_5     False
dtype: bool

In [225]:
series > [1,2,3,4,5]

row_10     True
col_2      True
row_3     False
row_4     False
row_5      True
dtype: bool

In [226]:
series == series

row_10     True
col_2      True
row_3     False
row_4      True
row_5      True
dtype: bool

In [ ]:
series > df_1['col_1'] # не совпадают индексы

ValueError: Can only compare identically-labeled Series objects

In [228]:
df_1['col_1'] <=df_1['col_2']

row_1     True
row_2     True
row_3    False
row_4     True
row_5     True
dtype: bool

In [230]:
df_1 == 6 # сравнение с каждым элементом

       col_1  col_2  col_3
row_1  False  False  False
row_2   True   True  False
row_3  False  False   True
row_4  False  False  False
row_5  False  False  False

In [231]:
df_1  > [1,3,10] # сравнивается значения в списке, со всеми значениями в соответствующем столбце

       col_1  col_2  col_3
row_1   True   True  False
row_2   True   True   True
row_3  False   True  False
row_4   True   True   True
row_5   True   True  False

In [232]:
df_1 == df_2

       col_1  col_2  col_3
row_1   True   True   True
row_2   True   True   True
row_3  False   True   True
row_4  False  False   True
row_5  False  False   True

In [233]:
df_1 == df_2[['col_2','col_1','col_3']] # важна индекс столбцов

ValueError: Can only compare identically-labeled DataFrame objects

## Специальные методы для операции сравнения

In [234]:
df_1.le(6) # <

       col_1  col_2  col_3
row_1   True  False   True
row_2   True   True  False
row_3  False  False   True
row_4   True  False  False
row_5  False  False  False

In [ ]:
series.le(df_1['col_3']) # позволяет сравнивать с разными значениями строк и столбцов (сначала выравнивание строк, затем сравнение)

col_2     False
row_1     False
row_10    False
row_2     False
row_3     False
row_4      True
row_5      True
dtype: bool

In [237]:
df_1.le(df_2[['col_2','col_1']])

       col_1  col_2  col_3
row_1   True   True  False
row_2   True   True  False
row_3  False   True  False
row_4  False  False  False
row_5  False  False  False

## Метод equals()

In [239]:
df_1.equals(df_1)

True

In [ ]:
df_1.equals(df_1[['col_2','col_1','col_3']]) # замена столбцов влияет на равенство

False

In [241]:
df_1.equals(df_2)

False

In [242]:
series.equals(series)

True

# Lesson 9. Фильтрация данных

In [243]:
dict_array = {'age' : [53,37,11,18,7],
              'name':['Сергей','Маша','Ксюша','Аристарх','Соня'],
              'наличие авто':[True,True,False,True,False]}
df = pd.DataFrame(dict_array)
df

   age      name  наличие авто
0   53    Сергей          True
1   37      Маша          True
2   11     Ксюша         False
3   18  Аристарх          True
4    7      Соня         False

## Фильтрация данных по логическому условию

In [245]:
df[[True,False,True,False,True]]

   age    name  наличие авто
0   53  Сергей          True
2   11   Ксюша         False
4    7    Соня         False

In [246]:
df['наличие авто']

0     True
1     True
2    False
3     True
4    False
Name: наличие авто, dtype: bool

In [247]:
df[df['наличие авто']]

   age      name  наличие авто
0   53    Сергей          True
1   37      Маша          True
3   18  Аристарх          True

In [248]:
df['age']<=11

0    False
1    False
2     True
3    False
4     True
Name: age, dtype: bool

In [249]:
df[df['age']<=11]

   age   name  наличие авто
2   11  Ксюша         False
4    7   Соня         False

In [251]:
# нельзя использовать and и or, вместо них нужны битовые операции
df[(df['age']<=18)&(df['наличие авто'])]

   age      name  наличие авто
3   18  Аристарх          True

In [252]:
df[(df['age']>18) & df['наличие авто']]

   age    name  наличие авто
0   53  Сергей          True
1   37    Маша          True

In [253]:
df[(df['age']==18) | ~ df['наличие авто']]

   age      name  наличие авто
2   11     Ксюша         False
3   18  Аристарх          True
4    7      Соня         False

In [254]:
df.isin([53,'Ксюша'])

     age   name  наличие авто
0   True  False         False
1  False  False         False
2  False   True         False
3  False  False         False
4  False  False         False

In [255]:
df['age'].isin([53,18,7,1000])

0     True
1    False
2    False
3     True
4     True
Name: age, dtype: bool

In [256]:
df[df['age'].isin([53,18,7,1000])]

   age      name  наличие авто
0   53    Сергей          True
3   18  Аристарх          True
4    7      Соня         False

# Метод query()

In [258]:
df.query('not `наличие авто` and age<10')

   age  name  наличие авто
4    7  Соня         False

In [259]:
N=5 # можно использовать переменные в запросе
df.query('not `наличие авто` and age<3*@N')

   age   name  наличие авто
2   11  Ксюша         False
4    7   Соня         False

# Lesson 10. Пропуски в данных

In [260]:
dict_array = {'age' : [53,np.nan,11,18,7],
              'name':['Сергей','Маша','Ксюша','Аристарх','Соня'],
              'наличие авто':[True,True,False,np.nan,False],
              'марка авто':[np.nan,np.nan,np.nan,np.nan,np.nan]}
df = pd.DataFrame(dict_array)
df

    age      name наличие авто  марка авто
0  53.0    Сергей         True         NaN
1   NaN      Маша         True         NaN
2  11.0     Ксюша        False         NaN
3  18.0  Аристарх          NaN         NaN
4   7.0      Соня        False         NaN

## Метод dropna()

In [261]:
df.dropna() # возвращает новый DataFrame

Empty DataFrame
Columns: [age, name, наличие авто, марка авто]
Index: []

In [262]:
df[['age','name','наличие авто']].dropna()

    age    name наличие авто
0  53.0  Сергей         True
2  11.0   Ксюша        False
4   7.0    Соня        False

In [ ]:
df.dropna(axis = 1) # столбцы

       name
0    Сергей
1      Маша
2     Ксюша
3  Аристарх
4      Соня

In [ ]:
df.dropna(how = 'all') # будет удалены строки, где все элементы Nan

    age      name наличие авто  марка авто
0  53.0    Сергей         True         NaN
1   NaN      Маша         True         NaN
2  11.0     Ксюша        False         NaN
3  18.0  Аристарх          NaN         NaN
4   7.0      Соня        False         NaN

In [265]:
df.dropna(how = 'all',axis = 1)

    age      name наличие авто
0  53.0    Сергей         True
1   NaN      Маша         True
2  11.0     Ксюша        False
3  18.0  Аристарх          NaN
4   7.0      Соня        False

In [267]:
df.dropna(how = 'any')# будет удалены строки, где хотя бы один элемент Nan

Empty DataFrame
Columns: [age, name, наличие авто, марка авто]
Index: []

In [268]:
df.dropna(subset=['age','наличие авто']) # указываем строки или столбцы, где будем искать пропуски

    age    name наличие авто  марка авто
0  53.0  Сергей         True         NaN
2  11.0   Ксюша        False         NaN
4   7.0    Соня        False         NaN

In [269]:
df.dropna(subset=[1],axis =1)

       name наличие авто
0    Сергей         True
1      Маша         True
2     Ксюша        False
3  Аристарх          NaN
4      Соня        False

In [271]:
df.dropna(subset=['age','наличие авто'],inplace=True)
df

    age    name наличие авто  марка авто
0  53.0  Сергей         True         NaN
2  11.0   Ксюша        False         NaN
4   7.0    Соня        False         NaN

## Метод fillna

In [272]:
dict_array = {'age' : [53,np.nan,11,18,7],
              'name':['Сергей','Маша','Ксюша','Аристарх','Соня'],
              'наличие авто':[True,True,False,np.nan,False],
              'марка авто':[np.nan,np.nan,np.nan,np.nan,np.nan]}
df = pd.DataFrame(dict_array)
df

    age      name наличие авто  марка авто
0  53.0    Сергей         True         NaN
1   NaN      Маша         True         NaN
2  11.0     Ксюша        False         NaN
3  18.0  Аристарх          NaN         NaN
4   7.0      Соня        False         NaN

In [273]:
df.fillna(value=6)

    age      name наличие авто  марка авто
0  53.0    Сергей         True         6.0
1   6.0      Маша         True         6.0
2  11.0     Ксюша        False         6.0
3  18.0  Аристарх            6         6.0
4   7.0      Соня        False         6.0

In [274]:
df.fillna(value={'age':100,
                 'наличие авто': 'еще думает',
                 'марка авто':'такая беленькая'})

     age      name наличие авто       марка авто
0   53.0    Сергей         True  такая беленькая
1  100.0      Маша         True  такая беленькая
2   11.0     Ксюша        False  такая беленькая
3   18.0  Аристарх   еще думает  такая беленькая
4    7.0      Соня        False  такая беленькая

In [275]:
df.fillna(value=6,inplace=True)

## Методы isna() и notna()

In [276]:
dict_array = {'age' : [53,np.nan,11,18,7],
              'name':['Сергей','Маша','Ксюша','Аристарх','Соня'],
              'наличие авто':[True,True,False,np.nan,False],
              'марка авто':[np.nan,np.nan,np.nan,np.nan,np.nan]}
df = pd.DataFrame(dict_array)
df

    age      name наличие авто  марка авто
0  53.0    Сергей         True         NaN
1   NaN      Маша         True         NaN
2  11.0     Ксюша        False         NaN
3  18.0  Аристарх          NaN         NaN
4   7.0      Соня        False         NaN

In [277]:
df.isna()

     age   name  наличие авто  марка авто
0  False  False         False        True
1   True  False         False        True
2  False  False         False        True
3  False  False          True        True
4  False  False         False        True

In [279]:
df['age'].isna()

0    False
1     True
2    False
3    False
4    False
Name: age, dtype: bool

In [280]:
df[~df['age'].isna()]

    age      name наличие авто  марка авто
0  53.0    Сергей         True         NaN
2  11.0     Ксюша        False         NaN
3  18.0  Аристарх          NaN         NaN
4   7.0      Соня        False         NaN

In [281]:
df.notna()

     age  name  наличие авто  марка авто
0   True  True          True       False
1  False  True          True       False
2   True  True          True       False
3   True  True         False       False
4   True  True          True       False

In [282]:
df['name'].notna()

0    True
1    True
2    True
3    True
4    True
Name: name, dtype: bool

In [283]:
df[df['name'].notna()]

    age      name наличие авто  марка авто
0  53.0    Сергей         True         NaN
1   NaN      Маша         True         NaN
2  11.0     Ксюша        False         NaN
3  18.0  Аристарх          NaN         NaN
4   7.0      Соня        False         NaN

# Lesson 11. Удаление строк и столбцов

In [3]:
df = pd.DataFrame({'col_1':[5,6,np.nan,3,7],
                     'col_2':[27,6,7,40,70],
                     'col_3':[1,45,6,62,7]},
                     index = ['row_1','row_2','row_3','row_4','row_5'])
df

       col_1  col_2  col_3
row_1    5.0     27      1
row_2    6.0      6     45
row_3    NaN      7      6
row_4    3.0     40     62
row_5    7.0     70      7

## Метод drop()

In [10]:
df.drop('row_2') # метод возврашает новый DataFrame

       col_1  col_2  col_3
row_1    5.0     27      1
row_3    NaN      7      6
row_4    3.0     40     62
row_5    7.0     70      7

In [5]:
df.drop(['row_1','row_3'])

       col_1  col_2  col_3
row_2    6.0      6     45
row_4    3.0     40     62
row_5    7.0     70      7

In [6]:
df.drop(['col_2','col_3'],axis = 1)

       col_1
row_1    5.0
row_2    6.0
row_3    NaN
row_4    3.0
row_5    7.0

In [7]:
df.drop(index = 'row_3')

       col_1  col_2  col_3
row_1    5.0     27      1
row_2    6.0      6     45
row_4    3.0     40     62
row_5    7.0     70      7

In [8]:
df.drop(columns=['col_1','col_2'])

       col_3
row_1      1
row_2     45
row_3      6
row_4     62
row_5      7

In [9]:
df.drop(index = 'row_3',columns='col_3')

       col_1  col_2
row_1    5.0     27
row_2    6.0      6
row_4    3.0     40
row_5    7.0     70

In [11]:
df.drop(index = 'row_2',columns='col_1',inplace=True)

In [12]:
df

       col_2  col_3
row_1     27      1
row_3      7      6
row_4     40     62
row_5     70      7

## Метод astype()

In [15]:
category_list = ['a','b','c','d','e']

df = pd.DataFrame({'col_1':[i for i in range(1000)],
                   'col_2':[float(i) for i in range(1000)],
                   'col_3':[category_list[i%5] for i in range(1000)],
                   'col_4':[*pd.date_range(start='01-01-2000',periods=1000).strftime('%m-%d-%Y')]},
                   index = [f"row_{i}" for i in range(1000)])
df

         col_1  col_2 col_3       col_4
row_0        0    0.0     a  01-01-2000
row_1        1    1.0     b  01-02-2000
row_2        2    2.0     c  01-03-2000
row_3        3    3.0     d  01-04-2000
row_4        4    4.0     e  01-05-2000
...        ...    ...   ...         ...
row_995    995  995.0     a  09-22-2002
row_996    996  996.0     b  09-23-2002
row_997    997  997.0     c  09-24-2002
row_998    998  998.0     d  09-25-2002
row_999    999  999.0     e  09-26-2002

[1000 rows x 4 columns]

In [16]:
df.dtypes

col_1      int64
col_2    float64
col_3     object
col_4     object
dtype: object

In [ ]:
df.memory_usage() # везде выделяется по 8 байт на каждую строку(8*1000)

Index    8000
col_1    8000
col_2    8000
col_3    8000
col_4    8000
dtype: int64

In [ ]:
new_df = df.astype({'col_1':np.int8}) # произошло преобразование с потерей данных

In [ ]:
print(new_df.dtypes,end = '\n\n')
print(new_df.memory_usage())

col_1       int8
col_2    float64
col_3     object
col_4     object
dtype: object

Index    8000
col_1    1000
col_2    8000
col_3    8000
col_4    8000
dtype: int64

In [20]:
new_df = df.astype({'col_3':'category'})
new_df = df.astype({'col_4':'datetime64[ns]'})

In [21]:
print(new_df.dtypes,end = '\n\n')
print(new_df.memory_usage())

col_1             int64
col_2           float64
col_3            object
col_4    datetime64[ns]
dtype: object

Index    8000
col_1    8000
col_2    8000
col_3    8000
col_4    8000
dtype: int64

In [23]:
%%time
for i in range(1000):
    df['col_3'].str.upper()

CPU times: user 200 ms, sys: 5.86 ms, total: 205 ms
Wall time: 214 ms

In [ ]:
%%time # в теории должно быть быстрее
for i in range(1000):
    new_df['col_3'].str.upper()

CPU times: user 208 ms, sys: 9.95 ms, total: 218 ms
Wall time: 214 ms

In [25]:
df = df.astype({'col_1':np.int16,
                'col_2':np.float16,
                'col_3':'category',
                'col_4':'datetime64[ns]'})
df.reset_index(drop=True,inplace=True)

In [26]:
df

     col_1  col_2 col_3      col_4
0        0    0.0     a 2000-01-01
1        1    1.0     b 2000-01-02
2        2    2.0     c 2000-01-03
3        3    3.0     d 2000-01-04
4        4    4.0     e 2000-01-05
..     ...    ...   ...        ...
995    995  995.0     a 2002-09-22
996    996  996.0     b 2002-09-23
997    997  997.0     c 2002-09-24
998    998  998.0     d 2002-09-25
999    999  999.0     e 2002-09-26

[1000 rows x 4 columns]

In [27]:
print(df.dtypes,end = '\n\n')
print(df.memory_usage())

col_1             int16
col_2           float16
col_3          category
col_4    datetime64[ns]
dtype: object

Index     128
col_1    2000
col_2    2000
col_3    1212
col_4    8000
dtype: int64

# Lesson 12. Методы iat,at,iloc,loc.

In [34]:
dict_array = {'age' : [53,37,11,18,7],
              'name':['Сергей','Маша','Ксюша','Аристарх','Соня'],
              'наличие авто':[True,True,False,True,False]}

In [35]:
df = pd.DataFrame(dict_array,index=['row_0','row_1','row_2','row_3','row_4'])
df

       age      name  наличие авто
row_0   53    Сергей          True
row_1   37      Маша          True
row_2   11     Ксюша         False
row_3   18  Аристарх          True
row_4    7      Соня         False

## Доступ к одному элементу

In [36]:
df.iat[2,1]

'Ксюша'

In [37]:
df['age'].iat[3]

18

In [38]:
df.iat[4,0] = 'Новое имя'
df

             age      name  наличие авто
row_0         53    Сергей          True
row_1         37      Маша          True
row_2         11     Ксюша         False
row_3         18  Аристарх          True
row_4  Новое имя      Соня         False

In [39]:
df.at['row_3','name']

'Аристарх'

In [40]:
df['age'].at['row_2']

11

In [41]:
df.at['row_4','name']=100
df

             age      name  наличие авто
row_0         53    Сергей          True
row_1         37      Маша          True
row_2         11     Ксюша         False
row_3         18  Аристарх          True
row_4  Новое имя       100         False

## Доступ к группе строк/столбцов

In [42]:
df.iloc[1,1]

'Маша'

In [43]:
df['наличие авто'].to_list()

[True, True, False, True, False]

In [44]:
df.iloc[df['наличие авто'].to_list(),[True,False,False]]

      age
row_0  53
row_1  37
row_3  18

In [45]:
df.iloc[1:3,0]

row_1    37
row_2    11
Name: age, dtype: object

In [46]:
df.iloc[1:3,1] = 99
df

             age      name  наличие авто
row_0         53    Сергей          True
row_1         37        99          True
row_2         11        99         False
row_3         18  Аристарх          True
row_4  Новое имя       100         False

In [47]:
df.loc['row_2','name'] # Самый рекомендованный метод

99

In [48]:
df.loc[['row_1','row_2']]

      age name  наличие авто
row_1  37   99          True
row_2  11   99         False

In [49]:
df.loc[:,['age','name']]

             age      name
row_0         53    Сергей
row_1         37        99
row_2         11        99
row_3         18  Аристарх
row_4  Новое имя       100

In [50]:
df.loc['row_0':'row_3','name']

row_0      Сергей
row_1          99
row_2          99
row_3    Аристарх
Name: name, dtype: object

In [51]:
df.loc[df['name']==99]

      age name  наличие авто
row_1  37   99          True
row_2  11   99         False

In [53]:
df.loc['row_0':'row_2','name'] = 1
df

             age      name  наличие авто
row_0         53         1          True
row_1         37         1          True
row_2         11         1         False
row_3         18  Аристарх          True
row_4  Новое имя       100         False

In [54]:
df.loc['row_0':'row_2','name'] = [10,20,30]
df

             age      name  наличие авто
row_0         53        10          True
row_1         37        20          True
row_2         11        30         False
row_3         18  Аристарх          True
row_4  Новое имя       100         False

In [55]:
df.loc['row_0':'row_2','age'] = pd.Series(['Алексей','Марат','Саша'],index = ['row_0','row_1','row_2'])
df

             age      name  наличие авто
row_0    Алексей        10          True
row_1      Марат        20          True
row_2       Саша        30         False
row_3         18  Аристарх          True
row_4  Новое имя       100         False

In [56]:
df.loc['row_0':'row_2',['age','name']] = pd.DataFrame({'name':['Алексей','Марат','Саша'],
                                                       'age':[22,33,44]},index = ['row_0','row_1','row_2'])

In [57]:
df

             age      name  наличие авто
row_0         22   Алексей          True
row_1         33     Марат          True
row_2         44      Саша         False
row_3         18  Аристарх          True
row_4  Новое имя       100         False

In [60]:
# Замена двух столбцов местами
df.loc[:,['age','name']] = df[['name','age']]

In [61]:
df

             age      name  наличие авто
row_0         22   Алексей          True
row_1         33     Марат          True
row_2         44      Саша         False
row_3         18  Аристарх          True
row_4  Новое имя       100         False

In [62]:
df.loc[:,['age','name']] = df[['name','age']].to_numpy()

In [63]:
df

            age       name  наличие авто
row_0   Алексей         22          True
row_1     Марат         33          True
row_2      Саша         44         False
row_3  Аристарх         18          True
row_4       100  Новое имя         False

# Lesson 13. Полезные методы unique(),nunique(),value_counts(),sort_values()

In [74]:
dict_array = {'age' : [11,37,53,11,7],
              'name':['Сергей','Маша','Ксюша','Сергей','Соня'],
              'наличие авто':[True,True,False,True,False]}
df = pd.DataFrame(dict_array,index=['row_0','row_1','row_2','row_3','row_4'])
df

       age    name  наличие авто
row_0   11  Сергей          True
row_1   37    Маша          True
row_2   53   Ксюша         False
row_3   11  Сергей          True
row_4    7    Соня         False

In [75]:
df['age'].unique() # Применяется только к Series и Indexes

array([11, 37, 53,  7])

In [76]:
df['age'].nunique() # колво уникальных значений

4

In [77]:
df.nunique()

age             4
name            4
наличие авто    2
dtype: int64

In [78]:
df.value_counts()

age  name    наличие авто
11   Сергей  True            2
7    Соня    False           1
37   Маша    True            1
53   Ксюша   False           1
dtype: int64

In [79]:
df['наличие авто'].value_counts()

True     3
False    2
Name: наличие авто, dtype: int64

In [80]:
df.value_counts(['age','name'])

age  name
11   Сергей    2
7    Соня      1
37   Маша      1
53   Ксюша     1
dtype: int64

In [81]:
df.value_counts(['age','name'],dropna=False)

age  name
11   Сергей    2
7    Соня      1
37   Маша      1
53   Ксюша     1
dtype: int64

In [ ]:
df.value_counts('name',normalize=True) # Получаем пропорции

name
Сергей    0.4
Ксюша     0.2
Маша      0.2
Соня      0.2
dtype: float64

In [83]:
df.sort_values('age')

       age    name  наличие авто
row_4    7    Соня         False
row_0   11  Сергей          True
row_3   11  Сергей          True
row_1   37    Маша          True
row_2   53   Ксюша         False

In [84]:
df.sort_values(['age','name'])

       age    name  наличие авто
row_4    7    Соня         False
row_0   11  Сергей          True
row_3   11  Сергей          True
row_1   37    Маша          True
row_2   53   Ксюша         False

In [85]:
df.sort_values('age',na_position='first')

       age    name  наличие авто
row_4    7    Соня         False
row_0   11  Сергей          True
row_3   11  Сергей          True
row_1   37    Маша          True
row_2   53   Ксюша         False

In [86]:
df.sort_values('age',na_position='first',inplace=True)

In [87]:
df

       age    name  наличие авто
row_4    7    Соня         False
row_0   11  Сергей          True
row_3   11  Сергей          True
row_1   37    Маша          True
row_2   53   Ксюша         False

# Lesson 14. Метод apply

## Применение метода к DataFrame

In [88]:
dct = {f'col_{i}':[i*1,i*2,i*3,i*4,i*5] if i!=3 else [i,i,i,i,i] for i in range(5)}
dct

{'col_0': [0, 0, 0, 0, 0],
 'col_1': [1, 2, 3, 4, 5],
 'col_2': [2, 4, 6, 8, 10],
 'col_3': [3, 3, 3, 3, 3],
 'col_4': [4, 8, 12, 16, 20]}

In [89]:
df = pd.DataFrame(dct)
df

   col_0  col_1  col_2  col_3  col_4
0      0      1      2      3      4
1      0      2      4      3      8
2      0      3      6      3     12
3      0      4      8      3     16
4      0      5     10      3     20

In [90]:
df.apply(np.min)

col_0    0
col_1    1
col_2    2
col_3    3
col_4    4
dtype: int64

In [91]:
def my_func(series):
    return (series + 100) if series.name != 'col_2' else series*0

In [92]:
df.apply(my_func)

   col_0  col_1  col_2  col_3  col_4
0    100    101      0    103    104
1    100    102      0    103    108
2    100    103      0    103    112
3    100    104      0    103    116
4    100    105      0    103    120

In [93]:
df.apply(lambda series: (series + 100) if series.name != 'col_2' else series*0)

   col_0  col_1  col_2  col_3  col_4
0    100    101      0    103    104
1    100    102      0    103    108
2    100    103      0    103    112
3    100    104      0    103    116
4    100    105      0    103    120

In [94]:
df.apply(np.mean,axis=1)

0    2.0
1    3.4
2    4.8
3    6.2
4    7.6
dtype: float64

In [ ]:
df.apply(np.mean,axis=0,raw = True) # данные будут передавать в виде массива numpy

col_0     0.0
col_1     3.0
col_2     6.0
col_3     3.0
col_4    12.0
dtype: float64

In [96]:
dct = {f'col_{i}': range(1000) for i in range(100)}
df_1 = pd.DataFrame(dct)
df_1

,col_0,col_1,col_2,col_3,col_4,col_5,col_6,col_7,col_8,col_9,...,col_90,col_91,col_92,col_93,col_94,col_95,col_96,col_97,col_98,col_99
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
2,2,2,2,2,2,2,2,2,2,2,...,2,2,2,2,2,2,2,2,2,2
3,3,3,3,3,3,3,3,3,3,3,...,3,3,3,3,3,3,3,3,3,3
4,4,4,4,4,4,4,4,4,4,4,...,4,4,4,4,4,4,4,4,4,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,995,995,995,995,995,995,995,995,995,995,...,995,995,995,995,995,995,995,995,995,995
996,996,996,996,996,996,996,996,996,996,996,...,996,996,996,996,996,996,996,996,996,996
997,997,997,997,997,997,997,997,997,997,997,...,997,997,997,997,997,997,997,997,997,997
998,998,998,998,998,998,998,998,998,998,998,...,998,998,998,998,998,998,998,998,998,998
999,999,999,999,999,999,999,999,999,999,999,...,999,999,999,999,999,999,999,999,999,999

In [99]:
from time import time
start = time()
df_1.apply(np.sum,axis = 0,raw = False)
finish = time()

print(round(finish-start,3))

0.068

In [ ]:
from time import time
start = time()
df_1.apply(np.sum,axis = 0,raw = True) # Работает намного быстрее
finish = time()

print(round(finish-start,3))

0.011

In [102]:
dict_array = {'age' : [11,37,53,11,7],
              'name':['Фамилия_1 Имя_1','Фамилия_2 Имя_2 Отчество_2','Фамилия_3 Имя_3','Фамилия_4 Имя_4','Фамилия_5 Имя_5'],
              'наличие авто':[True,True,False,True,False]}
df = pd.DataFrame(dict_array)
df

   age                        name  наличие авто
0   11             Фамилия_1 Имя_1          True
1   37  Фамилия_2 Имя_2 Отчество_2          True
2   53             Фамилия_3 Имя_3         False
3   11             Фамилия_4 Имя_4          True
4    7             Фамилия_5 Имя_5         False

In [103]:
df['name']

0               Фамилия_1 Имя_1
1    Фамилия_2 Имя_2 Отчество_2
2               Фамилия_3 Имя_3
3               Фамилия_4 Имя_4
4               Фамилия_5 Имя_5
Name: name, dtype: object

In [108]:
'Фамилия_2 Имя_2 Отчество_2'.split(' ')

['Фамилия_2', 'Имя_2', 'Отчество_2']

In [114]:
def my_func(series):
    name_split = series.str.split(' ')[0]

    if len(name_split) == 2:
        name_split.append(np.nan)
        print(name_split)
    return name_split

In [115]:
df[['name']]

                         name
0             Фамилия_1 Имя_1
1  Фамилия_2 Имя_2 Отчество_2
2             Фамилия_3 Имя_3
3             Фамилия_4 Имя_4
4             Фамилия_5 Имя_5

In [116]:
df[['name']].apply(my_func,axis=1)

['Фамилия_1', 'Имя_1', nan]
['Фамилия_3', 'Имя_3', nan]
['Фамилия_4', 'Имя_4', nan]
['Фамилия_5', 'Имя_5', nan]

0           [Фамилия_1, Имя_1, nan]
1    [Фамилия_2, Имя_2, Отчество_2]
2           [Фамилия_3, Имя_3, nan]
3           [Фамилия_4, Имя_4, nan]
4           [Фамилия_5, Имя_5, nan]
dtype: object

In [117]:
df[['name']].apply(my_func,axis=1,result_type='expand')

['Фамилия_1', 'Имя_1', nan]
['Фамилия_3', 'Имя_3', nan]
['Фамилия_4', 'Имя_4', nan]
['Фамилия_5', 'Имя_5', nan]

           0      1           2
0  Фамилия_1  Имя_1         NaN
1  Фамилия_2  Имя_2  Отчество_2
2  Фамилия_3  Имя_3         NaN
3  Фамилия_4  Имя_4         NaN
4  Фамилия_5  Имя_5         NaN

In [118]:
df[['last_name','first_name','patronymic']]=df[['name']].apply(my_func,axis=1,result_type='expand')
df

['Фамилия_1', 'Имя_1', nan]
['Фамилия_3', 'Имя_3', nan]
['Фамилия_4', 'Имя_4', nan]
['Фамилия_5', 'Имя_5', nan]

,age,name,наличие авто,last_name,first_name,patronymic
0,11,Фамилия_1 Имя_1,True,Фамилия_1,Имя_1,NaN
1,37,Фамилия_2 Имя_2 Отчество_2,True,Фамилия_2,Имя_2,Отчество_2
2,53,Фамилия_3 Имя_3,False,Фамилия_3,Имя_3,NaN
3,11,Фамилия_4 Имя_4,True,Фамилия_4,Имя_4,NaN
4,7,Фамилия_5 Имя_5,False,Фамилия_5,Имя_5,NaN

## Применение метода к Series

In [121]:
def get_patronymic(name):
    name_split = name.split(' ')

    return name_split[-1] if len(name_split) == 3 else np.nan

In [122]:
df['name'].apply(get_patronymic)

0           NaN
1    Отчество_2
2           NaN
3           NaN
4           NaN
Name: name, dtype: object

In [123]:
df['first_name']= df['name'].apply(lambda name:name.split(' ')[1])
df

,age,name,наличие авто,last_name,first_name,patronymic
0,11,Фамилия_1 Имя_1,True,Фамилия_1,Имя_1,NaN
1,37,Фамилия_2 Имя_2 Отчество_2,True,Фамилия_2,Имя_2,Отчество_2
2,53,Фамилия_3 Имя_3,False,Фамилия_3,Имя_3,NaN
3,11,Фамилия_4 Имя_4,True,Фамилия_4,Имя_4,NaN
4,7,Фамилия_5 Имя_5,False,Фамилия_5,Имя_5,NaN

In [131]:
def my_func(series,*args):
    if not isinstance(series,pd.Series):
        raise Exception('Была передана не Series')
    if len(args) == 0:
        return '___'
    if len(args) > 3:
        raise Exception('Много аргументов в args')
    
    name_split = series.str.split(' ')[0]
    if len(name_split) == 2:
        name_split.append(np.nan)

    N = {'Ф': 0,
         'И': 1,
         'О': 2}
    
    name = [name_split[N[arg]] for arg in args if arg in N]
    
    return name

In [132]:
df['name'].apply(my_func) # Была передана не Series

Exception: Была передана не Series

In [133]:
df[['name']].apply(my_func,axis =1,result_type='expand',args=())

0    ___
1    ___
2    ___
3    ___
4    ___
dtype: object

In [134]:
df[['name']].apply(my_func,axis =1,result_type='expand',args=('Ф','3','О','2','dddd'))

Exception: Много аргументов в args

In [135]:
df[['name']].apply(my_func,axis =1,result_type='expand',args=('О','Ф',111))

            0          1
0         NaN  Фамилия_1
1  Отчество_2  Фамилия_2
2         NaN  Фамилия_3
3         NaN  Фамилия_4
4         NaN  Фамилия_5

# Lesson 15. Агрегация данный, метод agg()

In [136]:
df = pd.DataFrame([[1,2,3],
                   [4,5,6],
                   [7,8,9],
                   [np.nan,np.nan,np.nan]],
                   columns=['col_1','col_2','col_3'])
df

   col_1  col_2  col_3
0    1.0    2.0    3.0
1    4.0    5.0    6.0
2    7.0    8.0    9.0
3    NaN    NaN    NaN

In [137]:
df.min()

col_1    1.0
col_2    2.0
col_3    3.0
dtype: float64

In [ ]:
df.mean() # не учитываются пропуски в данных

col_1    4.0
col_2    5.0
col_3    6.0
dtype: float64

In [139]:
df.count()

col_1    3
col_2    3
col_3    3
dtype: int64

In [140]:
df['col_3'].sum()

18.0

## Метод agg()

In [141]:
df.agg('mean')

col_1    4.0
col_2    5.0
col_3    6.0
dtype: float64

In [142]:
df.agg(np.mean)

col_1    4.0
col_2    5.0
col_3    6.0
dtype: float64

In [143]:
def my_func(series):
    return series.min() +100

In [144]:
df.agg(my_func)

col_1    101.0
col_2    102.0
col_3    103.0
dtype: float64

In [145]:
df.agg([np.max,np.sum,np.mean])

      col_1  col_2  col_3
max     7.0    8.0    9.0
sum    12.0   15.0   18.0
mean    4.0    5.0    6.0

In [146]:
df.agg(np.max,axis =1)

0    3.0
1    6.0
2    9.0
3    NaN
dtype: float64

In [148]:
df['col_3'].agg([np.max,np.sum,np.mean])

max      9.0
sum     18.0
mean     6.0
Name: col_3, dtype: float64

In [149]:
df.agg({'col_1':[np.min,np.sum],
        'col_3':'mean'})

      col_1  col_3
min     1.0    NaN
sum    12.0    NaN
mean    NaN    6.0

In [150]:
df.agg(min_col_1 = ('col_1','min'),max_col_2 = ('col_2',np.max)) # именнованая агрегация

           col_1  col_2
min_col_1    1.0    NaN
max_col_2    NaN    8.0

In [151]:
df.agg(min_col_1 = ('col_1','min'),my_func = ('col_2',my_func)) # именнованая агрегация

           col_1  col_2
min_col_1    1.0    NaN
my_func      NaN  102.0

## Lesson 16. Группировка данных. Метод groupby

In [2]:
df = pd.DataFrame({'Имя':['name_1','name_2','name_3','name_3','name_3','name_2','name_4'],
                   'Город_работы':['city_1','city_2','city_3','city_3','city_4','city_1',np.nan],
                   'Как_долго_работал':[12,24,36,12,48,5,np.nan]})
df

      Имя Город_работы  Как_долго_работал
0  name_1       city_1               12.0
1  name_2       city_2               24.0
2  name_3       city_3               36.0
3  name_3       city_3               12.0
4  name_3       city_4               48.0
5  name_2       city_1                5.0
6  name_4          NaN                NaN

In [ ]:
df.groupby('Имя') # Объект, который является генератором

In [4]:
groups = df.groupby('Имя') # Объект, который является генератором
for name,group in groups:
    print(name)
    print(group,end = '\n\n')

name_1
      Имя Город_работы  Как_долго_работал
0  name_1       city_1               12.0

name_2
      Имя Город_работы  Как_долго_работал
1  name_2       city_2               24.0
5  name_2       city_1                5.0

name_3
      Имя Город_работы  Как_долго_работал
2  name_3       city_3               36.0
3  name_3       city_3               12.0
4  name_3       city_4               48.0

name_4
      Имя Город_работы  Как_долго_работал
6  name_4          NaN                NaN

In [5]:
df.groupby('Город_работы').sum()

/var/folders/th/dn5zc4dd3rz56c206fznc1th0000gn/T/ipykernel_31765/2261265045.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Город_работы').sum()

              Как_долго_работал
Город_работы
city_1                     17.0
city_2                     24.0
city_3                     48.0
city_4                     48.0

In [6]:
df.groupby('Город_работы',dropna = False).sum()

/var/folders/th/dn5zc4dd3rz56c206fznc1th0000gn/T/ipykernel_31765/368785785.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Город_работы',dropna = False).sum()

              Как_долго_работал
Город_работы
city_1                     17.0
city_2                     24.0
city_3                     48.0
city_4                     48.0
NaN                         0.0

In [8]:
df.groupby('Имя',as_index=False).sum()

/var/folders/th/dn5zc4dd3rz56c206fznc1th0000gn/T/ipykernel_31765/2170081307.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Имя',as_index=False).sum()

      Имя  Как_долго_работал
0  name_1               12.0
1  name_2               29.0
2  name_3               96.0
3  name_4                0.0

In [9]:
df.groupby('Имя')['Как_долго_работал'].sum()

Имя
name_1    12.0
name_2    29.0
name_3    96.0
name_4     0.0
Name: Как_долго_работал, dtype: float64

In [13]:
df.groupby(['Имя','Город_работы'],dropna=False).count().rename(columns={'Как_долго_работал':'count'})

                     count
Имя    Город_работы
name_1 city_1            1
name_2 city_1            1
       city_2            1
name_3 city_3            2
       city_4            1
name_4 NaN               0

In [14]:
df.groupby('Имя')['Город_работы'].nunique()

Имя
name_1    1
name_2    2
name_3    2
name_4    0
Name: Город_работы, dtype: int64

In [16]:
df.groupby('Имя').agg({'Как_долго_работал':np.sum})

        Как_долго_работал
Имя
name_1               12.0
name_2               29.0
name_3               96.0
name_4                0.0

In [17]:
df.groupby('Имя').agg({'Как_долго_работал':[np.sum,np.max],
                       'Город_работы':'count'})

       Как_долго_работал       Город_работы
                     sum   max        count
Имя
name_1              12.0  12.0            1
name_2              29.0  24.0            2
name_3              96.0  48.0            3
name_4               0.0   NaN            0

In [20]:
df.groupby('Имя',as_index=False).agg(experience = ('Как_долго_работал',np.sum),
                       count_jobs = ('Город_работы','count'))

      Имя  experience  count_jobs
0  name_1        12.0           1
1  name_2        29.0           2
2  name_3        96.0           3
3  name_4         0.0           0